In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name": ['harry','rohan','skillf','shubh'],
    "marks": [92,34,24,17],
    "city": ['rampur','kolkata','bareilly','antartica']
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [6]:
df.to_csv('friends.csv') # converting data to csv(excel sheet)

In [7]:
df.to_csv('friends_index_false.csv',index = False) # if we dont want index for each data entry

In [8]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [9]:
df.tail(2)

     name  marks       city
2  skillf     24   bareilly
3   shubh     17  antartica

In [10]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [11]:
harry = pd.read_csv('harry.csv')

In [12]:
harry

   Train No  Speed       City
0     12322     34     Rampur
1     12534    123    Kolkata
2    125654     67   Bareilly
3    564523     87  Antartica

In [14]:
harry['Speed'][0] = 50 # changing the speed of zeroth train

/tmp/ipykernel_10418/805298609.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Speed'][0] = 50

In [15]:
harry.to_csv('harry.csv')

In [16]:
harry.index = ['first','second','third','fourth'] # changing index of dataframes

In [17]:
harry

        Train No  Speed       City
first      12322     50     Rampur
second     12534    123    Kolkata
third     125654     67   Bareilly
fourth    564523     87  Antartica